In [35]:
import pandas as pd
import numpy as np

In [36]:
df = pd.DataFrame(np.arange(0, 20).reshape(5, 4), index= [f"Row{i}" for i in range(1, 6)], columns= [f"Column{i}" for i in range(1, 5)])

In [37]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [10]:
df.iloc[:4,:3]

      Column1  Column2  Column3
Row1        0        1        2
Row2        4        5        6
Row3        8        9       10
Row4       12       13       14

In [15]:
df.value_counts()

Column1  Column2  Column3  Column4
0        1        2        3          1
4        5        6        7          1
8        9        10       11         1
12       13       14       15         1
16       17       18       19         1
Name: count, dtype: int64

In [38]:
df.loc["Row2", "Column2"] = 10

In [39]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4       10        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [41]:
df.value_counts()

Column1  Column2  Column3  Column4
0        1        2        3          1
4        10       6        7          1
8        9        10       11         1
12       13       14       15         1
16       17       18       19         1
Name: count, dtype: int64

In [42]:
df.loc["Row2", "Column3"] = 10

In [45]:
df["Column2"].value_counts()

Column2
1     1
10    1
9     1
13    1
17    1
Name: count, dtype: int64

In [46]:
df["Column2"].unique()

array([ 1, 10,  9, 13, 17])